class L2mCoordinates:
    DAY_DUNGEON = {
        0: [
            ("click", 320, 265, 0.4),
            ("click", 603, 328, 15),
            ("click", 608, 55, 1),
            ("click", 514, 189, 2.5),
            ("click", 283, 92, 2),
            ("click", 238, 155, 1),
        ],
        1: [
            ("click", 320, 265, 0.4),
            ("click", 603, 328, 15),
            ("click", 608, 55, 1),
            ("click", 514, 189, 2.5),
            ("click", 283, 92, 2),
            ("click", 238, 229, 1),
        ],
        2: [
            ("click", 320, 265, 0.4),
            ("click", 603, 328, 15),
            ("click", 608, 55, 1),
            ("click", 514, 189, 2.5),
            ("click", 283, 92, 2),
            ("click", 238, 300, 1),
        ],
        3: [
            ("click", 320, 265, 0.4),
            ("click", 603, 328, 15),
            ("click", 608, 55, 1),
            ("click", 514, 189, 2.5),
            ("click", 283, 92, 2),
            ("move", 320, 325, 0.5),
            ("drag", 0, -200, 0.5),
            ("move", 320, 325, 0.5),
            ("drag", 0, -200, 0.5),
            ("click", 238, 155, 1),
        ],
        4: [
            ("click", 320, 265, 0.4),
            ("click", 603, 328, 15),
            ("click", 608, 55, 1),
            ("click", 514, 189, 2.5),
            ("click", 283, 92, 2),
            ("move", 320, 325, 0.5),
            ("drag", 0, -200, 0.5),
            ("move", 320, 325, 0.5),
            ("drag", 0, -200, 0.5),
            ("click", 238, 229, 1),
        ],
        5: [
            ("click", 320, 265, 0.4),
            ("click", 603, 328, 15),
            ("click", 608, 55, 1),
            ("click", 514, 189, 2.5),
            ("click", 283, 92, 2),
            ("move", 320, 325, 0.5),
            ("drag", 0, -200, 0.5),
            ("move", 320, 325, 0.5),
            ("drag", 0, -200, 0.5),
            ("click", 238, 300, 1),
        ],
        6: [
            ("click", 320, 265, 0.4),
            ("click", 603, 328, 15),
            ("click", 608, 55, 1),
            ("click", 514, 189, 2.5),
            ("click", 283, 92, 2),
            ("click", 238, 155, 1),
        ],
    }

    Day_AFTER_ENTER = [
        ("click", 517, 367, 0.4),
        ("click", 416, 136, 0.4),
        ("click", 390, 275, 2),
        ("click", 523, 225, 1),
        ("click", 295, 90, 0.4),
        ("click", 255, 90, 0.4),
        ("click", 220, 90, 0.4),
        ("click", 185, 90, 0.4),
        ("click", 155, 90, 0.4),
        ("click", 361, 351, 10),
        ("click", 23, 254, 0.5),
        ("click", 320, 265, 0.5),
    ]

    Dayily = {
        "혈맹_절전Move": ("move", 320, 265, 1),
        "혈맹_절전Drag": ("drag", -250, 0, 0.5),
        "혈맹_대기기": ("sleep", 10),
        "혈맹_메뉴": ("click", 610, 55, 1),
        "혈맹_진입": ("click", 579, 189, 2),
        "혈맹_출석보상": ("click", 174, 299, 0.5),
        "혈맹_기부": ("click", 346, 368, 0.5),
        "혈맹_일괄기부": ("click", 162, 327, 0.5),
        "혈맹_기부닫기": ("click", 568, 87, 0.5),
        "혈맹_전체닫기": ("click", 615, 60, 1),
        "연합_메뉴": ("click", 610, 55, 1),
        "연합_진입": ("click", 608, 190, 2),
        "연합_기부": ("click", 346, 369, 0.5),
        "연합_일괄기부": ("click", 324, 326, 0.5),
        "연합_기부닫기": ("click", 568, 87, 0.5),
        "연합_전체닫기": ("click", 615, 60, 1),
        "데일리_메뉴": ("click", 610, 55, 1),
        "데일리_데일리": ("click", 482, 230, 1),
        "데일리_혜택받기": ("click", 483, 199, 1),
        "데일리_초과수령확인": ("click", 372, 279, 2),
        "데일리_2번탭_진입": ("click", 587, 151, 1),
        "데일리_2번탭_혜택받기": ("click", 483, 199, 1),
        "데일리_2번탭_초과수령확인": ("click", 372, 279, 2),
        "데일리_닫기": ("click", 615, 60, 1),
        "메뉴_우편": ("click", 610, 55, 1),
        "우편_진입": ("click", 451, 323, 2),
        "우편_모두받기": ("click", 575, 369, 4),
        "우편_초과수령확인": ("click", 372, 279, 2),
        "우편_닫기": ("click", 615, 60, 1),
        "절전_클릭": ("click", 24, 254, 0.5),
        "절전_확인": ("click", 320, 230, 1),
    }

    potion = {
        
        "기본_창클릭": ("click",  320, 265, 0.5),
        "기본_마을귀환": ("click",  604, 328, 12),
        "포션_절전Move": ("move", 320, 265, 0.3),
        "혈맹_절전Drag": ("drag", -250, 0, 0.5),
        "혈맹_대기기": ("sleep", 2),

        "기본_잡화상인": ("click", 55, 112, 20),
        "이벤트_자동담기": ("click", 505, 366, 0.4),
        "이벤트_정령탄": ("click", 81, 268, 0.4),
        "이벤트_49_9프로": ("click", 336, 365, 0.4),
        "이벤트_구매결정": ("click", 587, 367, 1),
        "이벤트_구매확인": ("click", 372, 278, 1),
        "이벤트_잡화닫기": ("click", 615, 60, 1),
        "메뉴_스케줄러": ("click", 610, 55, 1),
        "스케줄러_진입": ("click", 451, 232, 1),
        "스케줄러_시작": ("click", 547, 367, 8),
        "스케줄러_절전": ("click", 24, 254, 0.5),
        "스케줄러_확인": ("click", 320, 230, 1),
    }

    cashShop = {
        "샵구매_절전Move": ("move", 320, 265, 1),
        "혈맹_절전Drag": ("drag", -250, 0, 0.5),
        "혈맹_대기기": ("sleep", 10),
        "샵_클릭": ("click", 484, 59, 3),
        "팝업_닫기": ("click", 626, 346, 1),
        "교환4번탭일때": ("click", 324, 91, 0.5),
        "공통_일괄구매": ("click", 581, 381, 1),
        "공통_구매확인": ("click", 372, 344, 5),
        "레아탭": ("click", 564, 163, 0.5),
        "레아_일괄구매": ("click", 581, 381, 1),
        "레아_구매확인": ("click", 372, 344, 5),
        "사제탭": ("click", 568, 227, 0.5),
        "사제_일괄구매": ("click", 581, 381, 1),
        "사제_구매확인": ("click", 372, 344, 5),
        "캐시상점_닫기": ("click", 615, 60, 1),
        "상점절전_클릭": ("click", 24, 254, 0.5),
        "상점절전_확인": ("click", 320, 230, 1),
    }

    EventDungeon = {
        "이벤트던전_절전Move": ("move", 320, 265, 1),
        "이벤트던전_절전Drag": ("drag", -250, 0, 0.5),
        "이벤트던전_대기기": ("sleep", 10),
        "이벤트던전_메뉴": ("click", 610, 55, 1),
        "이벤트던전_던전": ("click", 514, 193, 2),
        "이벤트던전_선택": ("click", 174, 222, 0.5),
        "이벤트던전_입장": ("click", 536, 364, 0.5),
        "이벤트던전던전입장_80": ("click", 416, 240, 1),
        "이벤트던전던전난이도_70": ("click", 416, 210, 1),
        "이벤트던전던전난이도_60": ("click", 416, 175, 5),
        "이벤트던전절전_클릭": ("click", 25, 255, 1),
        "이벤트던전절전_확인": ("click", 320, 265, 1),
    }

    이벤트던전_여포 = {
        "가방_창클릭": ("click", 400, 265, 1),
        "여포던전_메뉴": ("click", 610, 55, 1),
        "여포던전_던전": ("click", 514, 193, 2),
        "여포던전_입장": ("click", 536, 364, 0.5),
    }

    우편받기 = {
        "가방_창클릭": ("click", 400, 265, 1),
        "우편_메뉴": ("click", 610, 55, 1),
        "우편_우편진입": ("click", 451, 323, 2),
        "우편_모두받기": ("click", 575, 369, 3),
        "우편_초과수령확인": ("click", 372, 279, 2),
        "우편_닫기": ("click", 615, 60, 2),
    }

    event_shop = {
        "너구리상점_귀환": ("click", 600, 326, 1),
        "너구리상점_귀환대기": ("sleep", 12),
        "너구리상점_상점클릭": ("click", 57, 88, 1),
        "너구리상점_이동대기": ("sleep", 10),
        "너구리상점_일괄담기": ("click", 506, 366, 0.2),
        "너구리상점_1번상품": ("repeat", 8, ("click", 91, 149, 0.2)),
        "너구리상점_2번상품": ("repeat", 6, ("click", 73, 185, 0.2)),
        "너구리상점_구매결정": ("click", 586, 365, 0.4),
        "너구리상점_구매확인": ("click", 371, 279, 1),
        "너구리상점_상점닫기": ("click", 612, 60, 1),
        "너구리상점_반지강화": ("click", 458, 359, 1),
        "너구리상점_다중선택": ("click", 362, 91, 1),
        "너구리상점_아이템다중선택": ("click", 582, 321, 1),
        "너구리상점_아이템다중선택2": ("click", 543, 318, 1),
        "너구리상점_4강선택": ("click", 280, 266, 1),
        "너구리상점_강화시작": ("click", 345, 311, 1),
        "너구리상점_파괴확인": ("click", 370, 278, 1),
    }

    가방열기 = {
        "가방_창클릭": ("click", 400, 265, 1),
        "가방_가방열기": ("click", 511, 54, 1.5),
        "가방_드래그이동_1": ("move", 530, 283, 0.5),
        "가방_절전Drag_1": ("drag", 0, -230, 0.3),
        "가방_드래그이동_2": ("move", 530, 283, 0.5),
        "가방_절전Drag_2": ("drag", 0, -230, 0.3),
    }

    사냥터귀환 = {

        "가방_창클릭": ("click", 400, 265, 1),
        "이벤트_자동사냥": ("click", 518, 224, 1),
        "이벤트_기억장소": ("click", 128, 87, 0.5),
        "이벤트_기억장소_2": ("click", 69, 179, 0.5),
        "이벤트_이동확인": ("click", 150, 203, 0.5),

    }

    경매장 = {
        "가방_창클릭": ("click", 400, 265, 1),
        "경매장_메뉴": ("click", 610, 55, 1),
        "경매장_경매장클릭": ("click", 481, 191, 2),
        "경매장_정산탭": ("click", 239, 94, 1),
        "경매장_정산받기": ("click", 570, 367, 1),
        "경매장_판매등록": ("click", 152, 92, 1),
        "경매장_모두선택": ("click", 417, 371, 1),
        "경매장_선택재등록": ("click", 589, 370, 1),
        "경매장_재등록확인": ("click", 379, 277, 1),
    }

    절전모드 = {
        "절전모드_창선택": ("click", 320, 235, 0.3),
        "절전모드_창닫기": ("click", 612, 59, 1),
        "절전모드_절전": ("click", 24, 255, 0.4),
        "절전모드_절전확인": ("click", 318, 221, 0.2),
    }

    절전해제 = {
        "절전해제_창선택": ("click", 320, 235, 0.3),
        "절전해제_절전드래그": ("drag", -250, 0, 0.7),
    }

    이벤트제작 = {
        "가방_창클릭": ("click", 400, 265, 1),

        "이벤트제작_메뉴": ("click", 610, 55, 1),
        "이벤트제작_제작": ("click", 452, 192, 1),
        "이벤트제작_이벤트탭": ("click", 437, 90, 1),
    }

    정령계초기화 = {
        "정령계_절전Move": ("move", 320, 265, 1),
        "정령계_절전Drag": ("drag", -250, 0, 0.5),
        "정령계_대기기": ("sleep", 10),
        "정령계_메뉴": ("click", 610, 55, 1),
        "정령계_아가시온": ("click", 481, 106, 1.5),
        "정령계_정령계": ("click", 313, 91, 1),
        "정령계_원정관리": ("click", 555, 364, 1),
        "정령계_일괄완료": ("click", 472, 366, 1),
        "정령계_완료확인": ("click", 370, 304, 2.5),
        "정령계_건너뛰기": ("click", 317, 368, 1),
        "정령계_건너뛰기확인": ("click", 317, 368, 1),
        "정령계_일괄시작": ("click", 571, 364, 1),
        "정령계_시작확인": ("click", 369, 326, 3),
        "정령계_닫기": ("click", 613, 58, 1),
        "정령계_절전": ("click", 24, 255, 0.4),
        "정령계_절전확인": ("click", 318, 221, 0.2),
    }

    시즌패스 = {
        "시즌패스_절전Move": ("move", 320, 265, 1),
        "시즌패스_절전Drag": ("drag", -250, 0, 0.5),
        "시즌패스_대기기": ("sleep", 10),
        "시즌패스_메뉴": ("click", 610, 55, 1),
        "시즌패스_시즌패스": ("click", 481, 318, 1.5),
    }

    아이템강화 = {
        "무기": [
            ("click", 320, 265, 0.1),
            ("click", 248, 359, 0.1),
            ("click", 248, 359, 1.5),
            ("click", 360, 90, 0.3),
            ("click", 581, 319, 0.3),
            ("click", 547, 319, 0.3),
            ("click", 386, 266, 0.3),
            ("click", 339, 314, 0.3),
            ("click", 371, 278, 0.1),
        ],
        "반지": [
            ("click", 320, 265, 0.1),
            ("click", 321, 359, 0.1),
            ("click", 321, 359, 1.5),
            ("click", 360, 90, 0.3),
            ("click", 581, 319, 0.3),
            ("click", 547, 319, 0.3),
            ("click", 255, 266, 0.3),
            ("click", 339, 314, 0.3),
            ("click", 371, 278, 0.1),
        ],
        "방어구": [
            ("click", 320, 265, 0.1),
            ("click", 286, 359, 0.1),
            ("click", 286, 359, 1.5),
            ("click", 360, 90, 0.3),
            ("click", 581, 319, 0.3),
            ("click", 547, 319, 0.3),
            ("click", 230, 266, 0.3),
            ("click", 339, 314, 0.3),
            ("click", 371, 278, 0.1),
        ],
    }

    고참상점 = {
        "여포_마을귀환": ("click", 601, 327, 7),
        "여포_잡화상인": ("click", 55, 88, 20),
        "여포_무기": ("click", 76, 147, 0.5),
        "여포_최대선택": ("repeat", 2, ("click", 338, 367, 1)),
        "여포_구매결정": ("click", 584, 363, 1),
        "여포_구매확인": ("click", 370, 276, 1),
        "여포_상점닫기": ("click", 610, 55, 1),
        # "여포_강화서": ("click", 606, 359, 1.5),
        # "여포_다중강화": ("click", 360, 93, 0.5),
        # "여포_전체등록": ("click", 582, 318, 0.5),
        # "여포_전체등록확인": ("click", 544, 320, 0.5),
        # "여포_7강": ("click", 361, 267, 0.5),
        # "여포_7강강화확인": ("click", 356, 313, 0.5),
        # "여포_7강파괴확인": ("click", 374, 278, 0.5),
    }
